Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: Who were you talking with?
jbo: do pu tavla ma

source: It seems that everybody likes golf.
jbo: si'au ro da nelci la golf

source: Who wrote this book?
jbo: ti cukta fi ma

source: I will go even if it rains tomorrow.
jbo: mi ba klama giju carvi ca lo bavlamdei

source: For example, he speaks German, French and English.
jbo: mu'a ra se bangu lo dotco e lo fraso e lo glico

source: I think it's worth asking.
jbo: pe'i vamji fa lo nu reisku

source: Most boys like computer games.
jbo: so'e nanla cu nelci lo skami se kelci

source: You know I can't.
jbo: do djuno lo du'u mi na kakne

source: Don't say that.
jbo: ko ti na cusku

source: That cannot be true.
jbo: lonu la'ede'u jetnu cu na cumki

source: I'm sorry to hear that.
jbo: .uu

source: It is impossible to do it.
jbo: nalcumki fa lo nu zukte ra

source: I will give you permission to do it.
jbo: mi curmi lo nu do co'e

source: Your demands are unreasonable.
jbo: .i lo selcpe be do cu tolracli

source: It is really wonderful.
jbo: je'a manci

source: It is necessary.
jbo: sarcu

source: It is of great use.
jbo: ti plixau mutce

source: It's white.
jbo: ko'a blabi

source: That was written by Taro Akagawa.
jbo: ta pu se ciska la .taros.akaga,uas.

source: It isn't new.
jbo: na'e cnino

source: It is new.
jbo: cnino

source: It's me.
jbo: mi'e mi

source: That was quite an effort for a child.
jbo: tu'a ta nandu lo verba

source: It will end in a waste of labor.
jbo: ba'a jalge fa lo nonprali nungu'a

source: Leave it where you found it.
jbo: ko cliva ko'a vi do pu facki fi ko'a

source: That's a copy.
jbo: ra fukpi

source: It's worth a try.
jbo: vamji fa lo nu troci

source: I think it's worth a try.
jbo: pe'i lo nu troci cu vamji

source: That was only a year ago.
jbo: pu fasnu za lo nanca be li pa po'o

source: What an interesting story it is!
jbo: tu'a lo lisri cu cinri sai

source: What is it?
jbo: ti mo

source: It was an exciting story and he told it well.
jbo: cnijicla lisri .ije xamgu cusku

source: I remember hearing a very similar story to that.
jbo: sei mi morji mi pu tirna lo simsa lisri

source: That will save me a lot of trouble.
jbo: di'u ba fanta lo raktu be mi

source: I could not persuade him that it was true.
jbo: mi pu na kakne lo nu bitygau ko'a lo du'u da pu jetnu

source: I do not know where it is.
jbo: mi na djuno fi lo se zvati

source: There is the train at 10 o'clock.
jbo: trene ti'u li pano

source: I have my own thoughts on that subject.
jbo: mi jinvi lo me mi moi lo ra se casnu

source: Please read that book.
jbo: .e'o ko tcidu le cukta

source: Where is the book?
jbo: lo cukta cu zvati ma

source: There were fifty passengers on the plane.
jbo: .i muno prenu cu klama fu lo vinji

source: There are a lot of eggs in the box.
jbo: tanxe so'i sovda

source: The box was full of books.
jbo: lo tanxe pu culno lo cukta

source: The cat likes to sleep beside me.
jbo: le mlatu cu nelci lo nu sipna ne'a mi

source: The two brothers are very much alike.
jbo: lo re bruna cu mutce simsa

source: The store closes at seven.
jbo: li ze cu tcika lo nu zarci sisti

source: Exactly!
jbo: .ie cai

source: That's the way.
jbo: ta tadji sa'e

source: The town grew into a city.
jbo: le cmatca cu zenba binxo lo tcadu

source: The town was destroyed during the war.
jbo: lo tcadu cu se daspo ca'o le nu jamna

source: The pond is very deep.
jbo: le cmala'u cu mutce condi

source: When I heard the news, I cried.
jbo: ca lo nu ve nuzba ku mi klaku

source: The man is anything but honest.
jbo: .i lo nanmu cu ckaji roda da'i poi na ka stace

source: The war took place 45 years ago.
jbo: pu jamna za lo nanca be li 45

source: There are plenty of fish in this river.
jbo: rau finpe cu nenri lo vi rirxe

source: The popular singer committed suicide.
jbo: lo sorselnelci sanga pu catra lo nei

source: The plants were damaged by the frost.
jbo: loi spati cu se xrani lo bisli

source: No one happened to be there.
jbo: ue no prenu cu zvati

source: The boy talks as if he were a girl.
jbo: lo nanla cu tavla simlu lo ka nixli

source: The girl smiled at me.
jbo: lo nixli cu cisma ga'a mi

source: Who is the author of the novel?
jbo: ma te brafi'a

source: The lady moved here a month ago.
jbo: le ninmu pu muvdu ti za la masti be li pa

source: The girl resembles her mother very much.
jbo: lo tixnu cu mutce simsa lo mamta be vo'a

source: The little girl is not capable of riding a bicycle.
jbo: lo cmalu nixli ku na'e ka'e sazri lo relxilma'e

source: Who wrote the letter?
jbo: ma pu ciska lo xatra

source: The car is ready.
jbo: le karce cu bredi

source: The car is exceeding the speed limit.
jbo: lo karce cu bancu lo sutra selbancu

source: I haven't heard from him since then.
jbo: co'a la'e di'u mi na ku ve nuzba ko'a

source: I asked him about the accident.
jbo: preti lo snuti mi ra

source: The man injured in the accident was taken to the hospital.
jbo: le nanmu poi selxai le snuti cu selbei fi lo spita

source: How many people were killed in the store?
jbo: xo lo remna pu se catra bu'u lo zarci

source: That incident drew his interest.
jbo: le fasnu ri ko'a ci'irgau

source: The boy remained silent.
jbo: lo nanla pu smaji

source: The child began to cry at the sight of the dog.
jbo: le verba puco'a klaku ca lonu ri viska le gerku

source: The child was almost drowned.
jbo: .i lo verba na ru'e jaurvasmro

source: He pressed his face against the shop window.
jbo: .i lo ko'a flira ku danre lo zarci canko gau ko'a

source: That kid was almost run over when the truck backed up.
jbo: lo nu lo va verba cu xe muvdu cu pu cumki ca lo nu lo bevma'e mo'i ti'a muvdu

source: I found it impossible to do the job in a day.
jbo: mi jinvi lo du'u to'e cumki fi'o ditcu pa djedi

source: I finished the work yesterday.
jbo: mi pu mo'u gunka ca lo prulamdei

source: We call the mountain Tsurugidake.
jbo: la tsurugidakes. cmene lo cmana mi'a

source: The author's name is familiar to us.
jbo: lo cmene be lo finti cu slabu mi

source: The lost child was found after two days.
jbo: lo selcri verba cu te facki ba lo djedi be li re

source: What does this word mean?
jbo: ma smuni le valsi

source: The dog is dying.
jbo: lo gerku ca'o mrobi'o

source: The show is over.
jbo: mo'u se tigni

source: The professor was unable to comprehend what I meant.
jbo: le profesoro pu na kakne lo nu jimpe lo nu mi te smuni makau

source: The machine is lying idle.
jbo: lo minji ca cando

source: All the students study English.
jbo: lo ro tadni cu tadni lo glibau

source: The meeting, in short, was a waste of time.
jbo: to'u le nunpenmi pu ka nalprali xaksu lo temci

source: The flower garden needs watering.
jbo: .ei dunda lo djacu lo xrula purdi

source: There is a river beside the house.
jbo: rirxe va le zdani

source: The bottle is filled with water.
jbo: le botpi cu se culno lo djacu

source: The string is very weak.
jbo: lo cinlysko cu mutce ruble

source: The tie goes with your jacket.
jbo: lo nebysrijge cu mapti lo do kosta

source: I didn't mean that.
jbo: mi na pu te smuni ra

source: And the boy did.
jbo: je lo nanla cu co'e

source: There was nobody there.
jbo: no prenu pu zvati

source: Who's there?
jbo: ma va zvati

source: He gave it a new name.
jbo: lo cnino ko'a ra co'a cmene

source: I'm not at all tired.
jbo: mi ba'e na tatpi

source: I have a cough.
jbo: mi te bilma kafke

source: She's a wonderful wife and mother.
jbo: ko'a banli speni je mamta

source: Excuse me, but can you help me?
jbo: ta'a xu do ka'e sidju mi

source: Mrs. Smith goes to church by car.
jbo: la .smit. klama lo xismalsi fu lo karce

source: A sponge absorbs liquids.
jbo: lo panje ku cokcu lo litki

source: Not all birds can fly.
jbo: ro cipni na kakne lo nu vofli

source: You must not trust every man.
jbo: .e'u do nitcu lo ka na lacri ro prenu

source: All the students are studying English.
jbo: lo ro tadni cu tadni lo glibau

source: Terrific!
jbo: banli

source: Wow!
jbo: .ue

source: Come back soon.
jbo: ko clira zmadu xruti

source: Soon you'll get used to living by yourself.
jbo: baziku do selsaubi'o lo ka pavysei selzda

source: I hope he'll get better soon.
jbo: .a'o ko'a ba zi kanro

source: I think I'll go skiing.
jbo: mi jinvi lo nu mi ba klama co skiji

source: I'll take your suitcase to your room.
jbo: .ai mi bevbe'i lo do dakli lo do kumfa

source: I'm Susan Greene.
jbo: mi'e suzyn.grin.

source: Excuse me, but is this the right way to the subway station?
jbo: ta'a .i xu ku'i ti drani farna lo lolnitre'e tcana

source: I'm from Singapore.
jbo: mi jbena fo lo gugdesugu

source: John went to America by air.
jbo: la djan. pu klama lo mergu'e fu le selvoi

source: John lives in New York.
jbo: la.djan. cu xabju la.nuiork.

source: What did John sing on the stage?
jbo: la.djan. cu sanga ma fi'o se cpana lo tsina

source: John was too surprised to say anything.
jbo: la djon pu dukse lo ka se spaji kei lo ka cusku da

source: John became a policeman.
jbo: la djan pu binxo lo pulji

source: John and I are old friends.
jbo: la jon e mi tolci'o pendo

source: John and Ann like each other.
jbo: la .djan. joi la .an. cu simxu nelci

source: The Joneses love their daughter.
jbo: za'u la djouns cu prami lo tixnu be lo nei

source: A man named George was staying at a hotel.
jbo: lo nanmu poi se cmene la djordj. pu ca'o xabju lo xotli

source: Judy smiled at me.
jbo: la.djudis. cisma ga'a mi

source: Judy is kind to everyone.
jbo: la judis xendo roda

source: You can count on Jack.
jbo: do ka'e lacri la.djak.

source: Jim is master of French and German.
jbo: la djim. certu lo fasybau .e lo dotybau

source: Jim is learning how to drive a car.
jbo: la jim cilre fi lo nu klasazri lo karce

source: Jim hasn't come yet.
jbo: la.djim. pu'o klama

source: Where is Jim?
jbo: la jim cu zvati ma

source: Do you know where Jim and Nancy are?
jbo: xu do djuno lo du'u la .djim. e la .nansis. zvati makau

source: Jim opens the door.
jbo: la djim cu kargau lo vorme

source: How long have you known Jim Robinson?
jbo: ma temci lo nu do penmi la .djim robinson.

source: Wait here for a while.
jbo: ko vi ze'a denpa

source: After patiently listening to the audience's complaints, the judges changed the results.
jbo: ba lo nu ko'a depyjdari zgatirna tu'a lo te patspu be fi le tertigni kei le pajni goi ko'a cu stika le jalge

source: Jane looks happy.
jbo: la.djein. simlu lo ka gleki

source: Jane is not able to swim.
jbo: la djein na kakne lo ka limna

source: The coelacanth inhabits the deep sea.
jbo: lo gombesa ku xabju lo condi je xamsi

source: I want to go to Seattle.
jbo: .au mi klama la.siatl.

source: I do not want any sandwiches.
jbo: mi na djica tu'a lo snuji

source: I'll be seeing you.
jbo: mi ba viska do

source: Let's play soccer.
jbo: e'u kelci lo fudbolo

source: I'd like some cider, please.
jbo: au e'o plise vanju

source: Come on, wake up.
jbo: .i ko cikna

source: Remember me to your parents.
jbo: .i ko jungau le do rirni lo du'u mi rinsa

source: I hear you have been sick.
jbo: .i lo du'u do bilga cu nuzba mi

source: Thank you for inviting me.
jbo: ckire do lo nu vitke friti fi mi

source: Write your address, please.
jbo: e'o ciska lo do judri

source: Help yourself.
jbo: .e'icu'i lebna ti

source: I wish you good luck.
jbo: di'ai do

source: Thank you in advance for your help.
jbo: ckire do lo nu do ba sidju

source: A computer is a complex machine.
jbo: lo skami cu pluja minji

source: Knowledge of computers is basic to all sciences.
jbo: le du'u djuno fi lo skami cu jicmu ro saske

source: Do you know how to operate a computer?
jbo: xu do djuno lo du'u ta'i ma kau pilno lo skami

source: Hi, George! How's it going?
jbo: co'oi ge'orge zo'u do mo

source: Hi, Mimi! How are you doing?
jbo: coi mimi .i pei

source: Hi, my name is Ken Saitou.
jbo: coi mi'e la .ken saitus.

source: Hello, Tom.
jbo: coi tam

source: Hi, Susan. How are you?
jbo: coi susan .i ba'e pei

source: Hi, how are you, everyone?
jbo: coi ro do .i pei

source: Hi! Do you work here?
jbo: coi .i xu do vi gunka

source: I have some doubts about his coming in this weather.
jbo: mi milxe lo ka senpi lo nu ko'a klama va'o lo vi tcima

source: You have all these books!
jbo: do ralte lo so'i vi cukta

source: Columbus believed that the Earth was round.
jbo: la .kolumbos. pu krici lo du'u la terdi cu bolci

source: I'll give you anything but this.
jbo: mi dunda ro drata be ti

source: There is no more disagreeable thing than this.
jbo: .i la'e dei traji lo ka na'e tugni fi ce'u

source: Can I eat this?
jbo: xu mi ka'e citka ti

source: Let this be an example to you.
jbo: .a'o ti tarmi tu'a do

source: Who broke this?
jbo: ma pofygau ti

source: Could you take this, please?
jbo: .e'o ko lebna ti

source: These are my books.
jbo: loi vi cukta cu se ralte mi

source: These books are my books.
jbo: le vi cukta mi se ralte

source: These books are easier than those books.
jbo: lo vi cukta cu zmadu lo va cukta lo ka frili

source: These pictures are beautiful.
jbo: lo vi za'u pixra cu melbi

source: These cameras are made in Japan.
jbo: loi vi kacma cu se zbasu bu'u lo pongu'e

source: These dogs are big.
jbo: lo'i vi gerku cu barda

source: This is a wooden house.
jbo: lo vi zdani cu mudri

source: This is an interesting story.
jbo: ti cinri lisri

source: This is a map.
jbo: ti cartu

source: Whose dictionary is this?
jbo: ma se ralte le vlacku

source: Whose bicycle is this?
jbo: me lo pe ma relxilma'e fa ti

source: Whose car is this?
jbo: ma ralte lo vi karce

source: Whose pencil is this?
jbo: lo vi pinsi zo'u ma ponse

source: This is a very old book.
jbo: ti mutce laldo cukta

source: This is a small book.
jbo: ti cmalu cukta

source: This is little different from what I want.
jbo: ti drata da poi sedjica be mi

source: This is a picture of my sister.
jbo: ti pixra lo mi mensi

source: This is the book I've been looking for.
jbo: ti du lo cukta poi mi caba'o sisku tu'a ke'a

source: This is the same watch that I lost a week ago.
jbo: ti du le junla poi mi pu cirko za lo jeftu be li pa

source: It seems to me that this is too expensive.
jbo: sei mi te simlu ti dukse kargu

source: This is an old book.
jbo: ti slabu cukta

source: This is a dog.
jbo: ti gerku

source: I don't like this one.
jbo: mi na nelci ti

source: This is a book about England.
jbo: ti cukta la .ingland.

source: This is a pen.
jbo: ti penbi

source: This is Tony's book.
jbo: lo vi cukta selpo'e la .tonis.

source: This is a very small book.
jbo: ti mutce cmalu cukta

source: This smells like cheese.
jbo: ti se panci lo cirla

source: This is the end.
jbo: ti fanmo

source: Everything is fine.
jbo: ro da xamgu

source: Are these the glasses you are looking for?
jbo: xu ko'a poi lacni cu se sisku do

source: This is the worst of all.
jbo: ti traji xlali

source: This is the most important matter of all.
jbo: ti traji vajni

source: Is this the book you spoke of the other day?
jbo: xu ti cukta poi do skicu ca lo za djedi

source: I'm not sure if this is correct.
jbo: mi na birti

source: Is this my life?
jbo: xu ti mivru'e mi

source: This is a new type of car.
jbo: ti cnino karce

source: This is the boy who helped me.
jbo: ti poi nanla ba sidju mi

source: This is a picture of my mother.
jbo: ti pixra lo mi mamta

source: This is why I hate him.
jbo: ki'u ko'e mi xebni ko'a

source: Here's my telephone number.
jbo: fonjudri mi

source: This is the house where I live.
jbo: mi xabju ti poi zdani

source: This is my car.
jbo: ti du le mi karce

source: Is this a river?
jbo: xu ti rirxe

source: Do you know whose car this is?
jbo: xu do djuno lo du'u makau ralte le vi karce

source: This book counts among the best of his work.
jbo: jinvi lo du'u le vi se cukta cu xagrai le'i ko'a prosa

source: This book deals with anthropology.
jbo: ti cukta lo antropo saske

source: This book belongs to me.
jbo: ti poi cukta cu se ponse mi

source: This book belongs to you.
jbo: do ponse lo vi cukta

source: This book ought to be a good seller.
jbo: la'a lo vi cukta cu xamgu se vecnu

source: Does this cap belong to you?
jbo: xu do ralte le vi mapku

source: This answer made him angry.
jbo: lo bi'unai danfu pu gasnu lo nu ko'a co'a fengu

source: There are no houses around here.
jbo: no da va zdani

source: It is very hot in this room, isn't it?
jbo: pei glare ne'i ti noi kumfa

source: Don't smoke in this room.
jbo: ko na sigja vasxu bu'u lo vi kumfa

source: Do you know how to open this box?
jbo: xu do djuno lo du'u ta'i ma kau kargau lo vi tanxe

source: I can't bear this pain.
jbo: mi na ka'e renvi le nu cortu

source: One out of three persons in this city has his own car.
jbo: pa fi'u ci lo prenu poi zvati ti poi tcadu cu ralte lo ri karce

source: I cannot accept this gift.
jbo: .e'enai mi zarcpa lo vi se dunda

source: These windows look to the south.
jbo: loi vi canko cu se bancu lo snanu

source: Do you like this color?
jbo: xu do nelci lo vi se skari

source: Please take me to this address.
jbo: e'o ko gidva mi tu'a lo vi judri

source: This car accommodates five people.
jbo: le vi karce cu vaska'e mu prenu

source: The price of this car is very high.
jbo: le vi karce cu di'atce

source: I'll lend you this dictionary.
jbo: mi ba te jbera lo vi vlacku do

source: This car is easy to handle.
jbo: ti poi karce cu frili se jitro

source: This bicycle belongs to my brother.
jbo: lo vi relxilma'e cu se ralte lo mi bruna

source: This watch is my father's.
jbo: lo vi kanjunla cu selpo'e lo mi patfu

source: What is the price of this watch?
jbo: ma jdima lo vi junla

source: Something has happened to this clock.
jbo: lo vi junla ba'o lifri da

source: This work is anything but easy.
jbo: tu'a le ca gunka cu na'e frili

source: I wish this job was over.
jbo: mi djica lo nu le jibri cu mulno

source: This dog was born two months ago.
jbo: lo vi gerku pu jbena za lo masti be li re

source: I want to remain anonymous in this.
jbo: mi djica stali lo nu mi cmecau vi

source: This type of mobile phone sells well.
jbo: le bevri fonxa poi simsa ti cu frili se vecnu

source: This tune is quite familiar to us all.
jbo: mi'a se slabu le zgike

source: I don't know the exact length of this bridge.
jbo: mi na djuno lo satci ni lo vi cripu cu clani

source: Is this fish still alive?
jbo: xu lo vi finpe cu ca ca'o jmive

source: Do you know how to use this machine?
jbo: pei do djuno lo du'u ta'i makau pilno le vi minji

source: Can you explain how this machine works?
jbo: xu do ka'e ciksi lo du'u ta'i ma kau sazri lo vi minji

source: This desk was too heavy to lift.
jbo: lo vi jubme pu dukse tilju lo nu lafti

source: This apple is sweet.
jbo: ti lo plise ku titla

source: Are you staying at this hotel?
jbo: xu do xabju lo vi xotli

source: This pen belongs to me.
jbo: lo vi penbi cu se ponse mi

source: These plums are ripe.
jbo: za'u ti flaume ku makcu

source: The knife is not sharp.
jbo: lo dakfu na kinli

source: This knife is very sharp.
jbo: lo ti dakfu cu mutce kinli

source: I don't like this jacket.
jbo: mi na nelci lo vi kosta

source: This candy costs eighty cents.
jbo: lo vi titspi cu fepni li bino

source: I think it will cost you more than 10,000 yen to have this camera fixed.
jbo: ba'a lo rupnu be li pa nononono lo nu tolpo'ugau le kacma cu jdima

source: This cuttlefish has started to lose its freshness.
jbo: lo nu le kalmari cu nilvifme'abi'o cu cfari

source: Is there a post office around here?
jbo: xu da va mribriju

source: This science fiction story seems interesting. Will you lend it to me when you have finished reading it?
jbo: .a'u lo cumymu'efi'a cu cinri .i .e'o ca lo nu tcidu mulno ku ko te jbera ra mi

source: Who broke the cup?
jbo: ma pofygau lo kabri

source: This one is prettier.
jbo: ti mlemau

source: This is a hospital.
jbo: ti spita

source: This place used to be a field.
jbo: .i vi ba'o foldi purdi

source: Does anyone here speak Japanese?
jbo: xu da vi se bangu lo ponjo

source: Here's some water.
jbo: vi djacu

source: Beware of pickpockets here.
jbo: .o'i vi zerle'a

source: Please wait here for a while.
jbo: e'o do denpa vi ze'a

source: This is the place where she works as a secretary.
jbo: ti ci'arse'u te briju ko'a

source: It is far from here to Tokyo.
jbo: lo selzva cu darno la tokios.

source: Can I telephone London from here?
jbo: mi kakne lo fonta'a be lo zvati be la lundyn.

source: Please give me some more coffee.
jbo: e'o ko ckafi zengau

source: Ken wants a bicycle.
jbo: la ken cu djica lo ka ralte lo relxilma'e

source: Ken has a guitar.
jbo: la .ken. cu ralte lo jgita

source: Divide the cake between you two.
jbo: ko fendi le titnanba seva'u redo

source: Kate talked over the picture with Brian.
jbo: la.keit. joi la.braiyn. pu casnu lo pixra

source: I've put on a lot of weight since Christmas.
jbo: mi mutce planybi'o ba lo xisyjbenunsla

source: Every pupil in the class is present.
jbo: ro ve ckule poi te ctufau cu zvati

source: Kumi is the girl whose father likes dogs.
jbo: la.kumin. nixli poi lo nelci be lo gerku cu patfu

source: Kuala Lumpur is worth visiting.
jbo: la kualalumpur cu se vamji lo ka te vitke

source: Cathy stopped picking flowers.
jbo: la .katis. xrula katna sisti

source: Oh, I lost the data!
jbo: ue mi cirko lo datni

source: You make me happy.
jbo: do ui jai se gleki mi

source: You are my sunshine.
jbo: do me lo pe mi solri gusni

source: Have you ever been to Nara?
jbo: xu da nu do la .naras. zvati

source: What a big house you have!
jbo: .u'e barda zdani do

source: I caught three fish yesterday.
jbo: mi kavbu ci finpe ca lo prulamdei

source: Only yesterday did I see him.
jbo: ca je nai pu lo prulamdei mi ko'a viska

source: It rained yesterday.
jbo: pu carvi ca lo prulamdei

source: He must love you.
jbo: ra bilga lo nu prami do

source: I want a guitar.
jbo: mi djica tu'a lo jgita

source: Where are you from, Karen?
jbo: do klama fi ma doi karen

source: My wife's trying to sleep.
jbo: lo me mi fetsi speni ku ca'o sipna troci

source: They speak English and French in Canada.
jbo: lo kadno prenu cu baupli fe lo glico fe lo fraso

source: At one time they lived in Nagoya.
jbo: .i ko'a pu xabju la nagoi,ias

source: There used to be a bridge here.
jbo: viba'oku cripa

source: Turn off the gas.
jbo: ko sisti tu'a lo gapci

source: Would you help me look for my keys?
jbo: e'u do sidju mi lo nu facki fi lo mi ckiku

source: I will look after your cat while you are away.
jbo: mi ba kurji lo do mlatu ca lo nu do to'e zvati

source: Your mother is anxious about your health.
jbo: .i lo mamta be do cu xanka lo do ni kanro

source: I'm getting hungry.
jbo: mi co'a xagji

source: Is the bath ready?
jbo: xu bredi lo nu jirsezlu'i

source: I can't eat meat.
jbo: mi ka'enai citka lo rectu

source: Boil some water.
jbo: ko febgau lo djacu

source: I'd like some tea, please.
jbo: au e'o tcati

source: Come and have tea with me.
jbo: ko klama tezu'e lonu mi'o pinxe lo tcati

source: Your dog is very big.
jbo: lo do gerku cu mutce barda

source: Take care of yourself.
jbo: ko kurji ko

source: Good-bye!
jbo: co'o

source: I received your letter.
jbo: mi ba'o terbe'i lo xatra be fi do

source: Is the kid still up?
jbo: xu le verba za'o cikna

source: Sit wherever you like.
jbo: ko zutse lo se nelci

source: Have a satsuma for dessert.
jbo: lo sairfa'o zo'u cidjrsatsuma .e'u

source: My money was stolen.
jbo: lo pe mi jdini ba'o se zerlebna

source: Money has changed his life.
jbo: lo jdini pu gafygau lo ra nunji'e

source: I don't see anything.
jbo: mi na viska da

source: We will go but you won't.
jbo: mi .enai do ba klama

source: The Netherlands is a small country.
jbo: la .nederland. cmalu gugde

source: If you are hungry, you can eat the bread.
jbo: do jaginai xagji gi ka'e citka lo nanba

source: He departed for London the day before yesterday.
jbo: ko'a co'a klama la lyndyn puza lo djedi be li re

source: My uncle gave me a camera.
jbo: lo mi famti pu dunda lo kacma mi
